In [12]:
import numpy as np
import pandas as pd

In [13]:
data1 = {'A': ['ahmed', 'ali', 'asmaa'],
         'M': ['mohamed', 'marina', 'magdy']}

In [14]:
data2 = {'S': ['samy', 'salma', 'somia'],
         'H': ['hany', 'heba', 'habiba']}

In [15]:
df1 = pd.DataFrame(data1)

In [16]:
df2 = pd.DataFrame(data2)

In [17]:
df1

       A        M
0  ahmed  mohamed
1    ali   marina
2  asmaa    magdy

In [18]:
df2

       S       H
0   samy    hany
1  salma    heba
2  somia  habiba

In [20]:
pd.concat([df1,df2],axis=1)

       A        M      S       H
0  ahmed  mohamed   samy    hany
1    ali   marina  salma    heba
2  asmaa    magdy  somia  habiba

In [21]:
pd.concat([df1,df2],axis=0)

       A        M      S       H
0  ahmed  mohamed    NaN     NaN
1    ali   marina    NaN     NaN
2  asmaa    magdy    NaN     NaN
0    NaN      NaN   samy    hany
1    NaN      NaN  salma    heba
2    NaN      NaN  somia  habiba

In [22]:
df1

       A        M
0  ahmed  mohamed
1    ali   marina
2  asmaa    magdy

In [23]:
df2.columns = df1.columns
df2

       A       M
0   samy    hany
1  salma    heba
2  somia  habiba

In [24]:
df = pd.concat([df1,df2],axis=0)
df

       A        M
0  ahmed  mohamed
1    ali   marina
2  asmaa    magdy
0   samy     hany
1  salma     heba
2  somia   habiba

In [25]:
df.index =range(len(df))
df

       A        M
0  ahmed  mohamed
1    ali   marina
2  asmaa    magdy
3   samy     hany
4  salma     heba
5  somia   habiba